2019.10.29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-29 Tue 09:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2019.10.15.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2019.11.05.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of October 15 to 29, 2019.
</p>

<p>
Sorry for the hiatus last week, I was away with no internet access.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">MirageOS 3.6.0 released</a></li>
<li><a href="#2">Is it possible to use Machine Learning and Deep Learning frameworks through OCaml?</a></li>
<li><a href="#3">Category theory for Programmers book - OCaml flavor</a></li>
<li><a href="#4">Ocaml-lxc (binding to Linux Containers) - progress report, looking for feedback and contributors</a></li>
<li><a href="#5">Ocaml-protoc-plugin 2.0.0</a></li>
<li><a href="#orgc4a30b6">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgba28b00" class="outline-2">
<h2 id="1">MirageOS 3.6.0 released</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/mirageos-3-6-0-released/4554/1">https://discuss.ocaml.org/t/mirageos-3-6-0-released/4554/1</a>
</p>
</div>

<div id="outline-container-org83f0686" class="outline-3">
<h3 id="org83f0686">Martin Lucina announced</h3>
<div class="outline-text-3" id="text-org83f0686">
<p>
We are pleased to announce the release of MirageOS 3.6.0. This release updates MirageOS to support <a href="https://github.com/Solo5/solo5">Solo5</a> 0.6.0 and later.
</p>

<p>
New features:
</p>

<ul class="org-ul">
<li>Support for the Solo5 <code>spt</code> (sandboxed process tender) target via <code>mirage configure -t spt</code>. The <code>spt</code> target runs MirageOS unikernels in a minimal strict seccomp sandbox on Linux <code>x86_64</code>, <code>aarch64</code> and <code>ppc64le</code> hosts.</li>
<li>Support for the Solo5 <span class="underline">application manifest</span>, enabling support for multiple network and block storage devices on the <code>hvt</code>, <code>spt</code> and <code>muen</code> targets. The <code>genode</code> and <code>virtio</code> targets are still limited to using a single network or block storage device.</li>
<li>Several notable security enhancements to Solo5 targets, such as enabling stack smashing protection throughout the toolchain by default and improved page protections on some targets.  For details, please refer to the Solo5 0.6.0 <a href="https://github.com/Solo5/solo5/releases/tag/v0.6.0">release notes</a>.</li>
</ul>

<p>
Additional user-visible changes:
</p>

<ul class="org-ul">
<li>Solo5 0.6.0 has removed the compile-time specialization of the <code>solo5-hvt</code> tender. As a result, a <code>solo5-hvt</code> binary is no longer built at <code>mirage build</code> time. Use the <code>solo5-hvt</code> binary installed in your <code>$PATH</code> by OPAM to run the unikernel.</li>
<li><code>mirage build</code> now produces silent <code>ocamlbuild</code> output by default. To get the old behaviour, run with <code>--verbose</code> or set the log level to <code>info</code> or <code>debug</code>.</li>
<li>New functions <code>Mirage_key.is_solo5</code> and <code>Mirage_key.is_xen</code>, analogous to <code>Mirage_key.is_unix</code>.</li>
</ul>

<p>
Thanks to @hannes for help with the release engineering for MirageOS 3.6.0.
</p>
</div>
</div>
</div>




<div id="outline-container-orgda4fdb3" class="outline-2">
<h2 id="2">Is it possible to use Machine Learning and Deep Learning frameworks through OCaml?</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/is-it-possible-to-use-machine-learning-and-deep-learning-frameworks-through-ocaml/4570/1">https://discuss.ocaml.org/t/is-it-possible-to-use-machine-learning-and-deep-learning-frameworks-through-ocaml/4570/1</a>
</p>
</div>

<div id="outline-container-org082d441" class="outline-3">
<h3 id="org082d441">Brando90 asked</h3>
<div class="outline-text-3" id="text-org082d441">
<p>
I was wondering if this was possible at all?
</p>

<p>
The reason I am asking is because there has been some attempts at doing this but from Python to OCaml like languages. Outlined here: <a href="https://coq.discourse.group/t/machine-learning-and-hammers-for-coq/303">https://coq.discourse.group/t/machine-learning-and-hammers-for-coq/303</a>
</p>
</div>
</div>


<div id="outline-container-org70a8621" class="outline-3">
<h3 id="org70a8621">Anton Kochkov replied</h3>
<div class="outline-text-3" id="text-org70a8621">
<p>
Yes it is totally possible, see these resources:
</p>
<ul class="org-ul">
<li><a href="https://ocaml.xyz/">OCaml Owl</a> scientific computing library, in particular <a href="https://ocaml.xyz/chapter/neural.html">Neural Networks</a> and <a href="https://ocaml.xyz/chapter/algodiff.html">Algorithmic Differentiation</a> chapters of their manual</li>
<li><a href="https://blog.janestreet.com/deep-learning-experiments-in-ocaml/">Deep Learning with OCaml</a> blog post from Jane Street</li>
<li><a href="https://discuss.ocaml.org/t/ocaml-for-data-science/1878">OCaml in Data Science</a> discussion at this forum</li>
<li><a href="https://discuss.ocaml.org/t/will-ocaml-be-a-good-choice-for-writing-high-performance-parallelizable-machine-learning-libraries/558">https://discuss.ocaml.org/t/will-ocaml-be-a-good-choice-for-writing-high-performance-parallelizable-machine-learning-libraries/558</a> discussion at this forum</li>
</ul>

<p>
If you are interested in improving the OCaml capabilites in this area, I think joining Owl development is the way to go, you can see their repositories here: <a href="https://github.com/owlbarn/">https://github.com/owlbarn/</a>
</p>

<p>
They have some ideas on possible improvements of the library at <a href="https://ocaml.xyz/project/proposal.html">Proposed Projects</a> page.
</p>
</div>
</div>


<div id="outline-container-org6300993" class="outline-3">
<h3 id="org6300993">Yaron Minsky added</h3>
<div class="outline-text-3" id="text-org6300993">
<p>
There's also a couple of followup posts to that first one:
</p>

<ul class="org-ul">
<li>One on <a href="https://blog.janestreet.com/playing-atari-games-with-ocaml-and-deep-rl/">reinforcement learning</a>, using pytorch via OCaml (creating bots for playing Atari games!)</li>
<li>One on  <a href="https://blog.janestreet.com/of-pythons-and-camels/">transfer learning</a> using pytorch as well.</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org047e96a" class="outline-2">
<h2 id="3">Category theory for Programmers book - OCaml flavor</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/category-theory-for-programmers-book-ocaml-flavor/3905/3">https://discuss.ocaml.org/t/category-theory-for-programmers-book-ocaml-flavor/3905/3</a>
</p>
</div>

<div id="outline-container-org1953c24" class="outline-3">
<h3 id="org1953c24">Arul announced</h3>
<div class="outline-text-3" id="text-org1953c24">
<p>
Hello, I've been working on translating this book in OCaml for few months now. @mseri has been kind enough to review all of my OCaml snippets and provide feedback. As we approach the final stages of this book(I'm currently translating snippets in Chapter21) and the book shows some advanced code, we were wondering if it'd be better to get more eyes on the OCaml snippets. Would anyone else be interested in reviewing the OCaml snippets of this book, atleast from Chapter 20 and out?
</p>

<p>
If so, you could join the conversation here - <a href="https://github.com/ArulselvanMadhavan/ocaml-ctfp/pull/22">https://github.com/ArulselvanMadhavan/ocaml-ctfp/pull/22</a>
and I will add you as reviewer to all future chapter releases.
</p>

<p>
Finally, Thanks @XVilka for posting about the book on here, before I even knew that it existed, and getting more traction for the book.
</p>
</div>
</div>
</div>




<div id="outline-container-orgbfa4ef9" class="outline-2">
<h2 id="4">Ocaml-lxc (binding to Linux Containers) - progress report, looking for feedback and contributors</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-lxc-binding-to-linux-containers-progress-report-looking-for-feedback-and-contributors/4581/1">https://discuss.ocaml.org/t/ocaml-lxc-binding-to-linux-containers-progress-report-looking-for-feedback-and-contributors/4581/1</a>
</p>
</div>

<div id="outline-container-orgf2d41bb" class="outline-3">
<h3 id="orgf2d41bb">Darren announced</h3>
<div class="outline-text-3" id="text-orgf2d41bb">
<p>
I'm writing to share the progress on <a href="https://github.com/darrenldl/ocaml-lxc">ocaml-lxc</a>, check if anyone's interested, and also looking for feedback or potential contributions
</p>
</div>

<div id="outline-container-org682253e" class="outline-4">
<h4 id="org682253e">Description</h4>
<div class="outline-text-4" id="text-org682253e">
<p>
ocaml-lxc is an OCaml binding to Linux Containers C API
</p>

<p>
The high level exposed design aims to largely match the one of <a href="https://github.com/lxc/go-lxc">go-lxc</a>, but with adjustments to make it more ergonomic and closer to idiomatic OCaml
</p>
</div>
</div>
</div>

<div id="outline-container-orgc4fe0bc" class="outline-3">
<h3 id="orgc4fe0bc">Progress</h3>
<div class="outline-text-3" id="text-orgc4fe0bc">
<ul class="org-ul">
<li>Low level API
<ul class="org-ul">
<li>Low level internal API (<code>lxc_c.ml</code>, <code>lxc_c.mli</code>) which matches closely with C API has been completed, and offers (almost) complete coverage of the C API</li>
</ul></li>
<li>High level API
<ul class="org-ul">
<li>Core parts of the high level exposed API (`lxc.ml`, `lxc.mli`) have been completed, you can see <a href="https://github.com/darrenldl/ocaml-lxc/blob/master/doc/GO_LXC_COMPARISON.md">here</a> for feature set comparison to go-lxc</li>
</ul></li>
<li>Documentation
<ul class="org-ul">
<li>You can see <a href="https://darrenldl.github.io/ocaml-lxc/">here</a> for the documentation of the high level API. I have not actually written the documention yet, so this is only useful for examining the library structure atm.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org58f5326" class="outline-4">
<h4 id="org58f5326">Architecture</h4>
<div class="outline-text-4" id="text-org58f5326">
<p>
This section is more useful if you're planning to contribute. Feel free to skip.
</p>

<ul class="org-ul">
<li>Code generation
<ul class="org-ul">
<li>Cinaps is used to generate glue code for both C and OCaml side to access <code>lxc_container</code> C struct function pointer fields. See <code>code_gen/gen.cinaps</code> for all the core code generation code.</li>
</ul></li>
<li>Stubs generation
<ul class="org-ul">
<li>Stubs generation via Ctypes is used to offer high confidence that things are done correctly at compile time. See <code>code_gen/ffi_bindings.ml</code>, <code>code_gen/ffi_types.ml</code>, <code>code_gen/types.ml</code>, and <code>code_gen/stubs_gen.ml</code>.</li>
</ul></li>
<li>C glue code
<ul class="org-ul">
<li>Additional glue code is added to handle things like conditional compilation based on LXC version, working around anonymous struct (not supported by Ctypes), etc. See <code>code_gen/lxc_glue.c</code> and <code>code_gen/lxc_glue.h</code>.</li>
</ul></li>
<li>Low level API
<ul class="org-ul">
<li>Low level API ties all the loose ends together, provides a fairly direct mapping to the C API, and is the main abstraction layer used by the higher level API. See <code>src/lxc_c.ml</code> and <code>src/lxc_c.mli</code>.</li>
</ul></li>
<li>High level API
<ul class="org-ul">
<li>High level API introduces more abstraction, masking C objects, and has a more hierarchical structure compared to the flat structure used by lower level API. See <code>src/lxc.ml</code> and <code>src/lxc.mli</code>.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org06bf007" class="outline-4">
<h4 id="org06bf007">What I'm looking for</h4>
<div class="outline-text-4" id="text-org06bf007">
<ul class="org-ul">
<li>If you're interested in using the library, please feel free to provide feedback on the API design
<ul class="org-ul">
<li>e.g. what can be improved, what you don't like, what's missing</li>
</ul></li>
<li>If you're interested in contributing, please feel free to reach out to me to coordinate etc. Following is the rough todo list I have atm
<ul class="org-ul">
<li>Add test code (copy go-lxc's test suite)</li>
<li>Add examples</li>
<li>API documentation</li>
<li>Document build flow architecture (specifically how dune fits into it maybe)</li>
<li>Document code architecture</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga9c6610" class="outline-4">
<h4 id="orga9c6610">TL;DR</h4>
<div class="outline-text-4" id="text-orga9c6610">
<p>
A lot of the core bits of ocaml-lxc are done and took way too much time, looking for people to help out with the remaining really tedious yet crucial parts. And get sanity checks from people who may become users of ocaml-lxc.
</p>
</div>
</div>
</div>

<div id="outline-container-org22bae0c" class="outline-3">
<h3 id="org22bae0c">Links</h3>
<div class="outline-text-3" id="text-org22bae0c">
<p>
This is just a aggregated list of the links above
</p>
<dl class="org-dl">
<dt>ocaml-lxc repo</dt><dd><a href="https://github.com/darrenldl/ocaml-lxc">https://github.com/darrenldl/ocaml-lxc</a></dd>
<dt>go-lxc repo</dt><dd><a href="https://github.com/lxc/go-lxc">https://github.com/lxc/go-lxc</a></dd>
<dt>Comparison to go-lxc</dt><dd><a href="https://github.com/darrenldl/ocaml-lxc/blob/master/doc/GO_LXC_COMPARISON.md">https://github.com/darrenldl/ocaml-lxc/blob/master/doc/GO_LXC_COMPARISON.md</a></dd>
<dt>API Documentation</dt><dd><a href="https://darrenldl.github.io/ocaml-lxc/">https://darrenldl.github.io/ocaml-lxc/</a></dd>
</dl>
</div>
</div>
</div>




<div id="outline-container-org01d6b0f" class="outline-2">
<h2 id="5">Ocaml-protoc-plugin 2.0.0</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-protoc-plugin-2-0-0/4582/1">https://discuss.ocaml.org/t/ann-ocaml-protoc-plugin-2-0-0/4582/1</a>
</p>
</div>

<div id="outline-container-orgdc81230" class="outline-3">
<h3 id="orgdc81230">Anders Fugmann announced</h3>
<div class="outline-text-3" id="text-orgdc81230">
<p>
It is my pleasure to announce  release of 2.0.0 of <a href="https://github.com/issuu/ocaml-protoc-plugin/">ocaml-protoc-plugin</a>.
</p>
</div>

<div id="outline-container-orgd47aa43" class="outline-4">
<h4 id="orgd47aa43">Highlights for this release</h4>
<div class="outline-text-4" id="text-orgd47aa43">
<ul class="org-ul">
<li>Moved to a new name: The main module have been renamed to <code>Ocaml_protoc_plugin</code> (from <code>Protobuf</code>), to avoid conflicts with projects still using <code>ocaml-protoc</code></li>
<li>Messages with only one field are not wrapped in a record by default. This can be controlled by the option <code>singleton_record</code>.</li>
<li>Oneof structures with only one field are not wrapped in a Polymorphic variant (controlled by option <code>singleton_record</code>)</li>
<li>Added googles <code>well known types</code></li>
</ul>

<p>
The release is available through opam: <code>opam install ocaml-protoc-plugin.2.0.0</code>, or from <a href="https://github.com/issuu/ocaml-protoc-plugin/releases/tag/2.0.0">github</a>
</p>
</div>
</div>

<div id="outline-container-orgc1edeac" class="outline-4">
<h4 id="orgc1edeac">Full changelog</h4>
<div class="outline-text-4" id="text-orgc1edeac">
<ul class="org-ul">
<li>Add examples</li>
<li>(*) Oneofs with only one element should not be a variant type</li>
<li>Add test when including proto files which defines the same package</li>
<li>Add google well know types (library <code>ocaml-protoc-plugin.google_types</code>).</li>
<li>(*) Move module to ocaml-protoc-plugin</li>
<li>Optimize deserialization of large nested structures</li>
<li>Provide pretty_printers aka deriving_show for <code>Result.error</code> and <code>Field.t</code></li>
<li>Fix stack overflow when deserializing big nested structures</li>
<li>(*) Add option to not wrap single field type in records</li>
<li>Refactor type emitter to closely follow spec (refactor)</li>
</ul>

<p>
(*) indicates breaking change
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-orgc4a30b6" class="outline-2">
<h2 id="orgc4a30b6">Old CWN</h2>
<div class="outline-text-2" id="text-orgc4a30b6">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="http://alan.petitepomme.net/cwn/">the archive</a> or the <a href="http://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname">
<p>
<a href="http://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
